{
  "format": "layers-model",
  "generatedBy": "keras v3.8.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_9",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "inputShape": [
                128,
                128,
                1
              ],
              "dtype": "float32",
              "sparse": false,
              "name": "input_layer_9"
            }
          }
        ],
        "build_input_shape": [
          null,
          128,
          128,
          1
        ]
      }
    }
  }
}